Revit 2024 API
BuiltInFailures.DesignOptionFailures.CannotAddToOptions Property
 Elements can't be added to Option Set
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotAddToOptions { get; }
Visual Basic
Public Shared ReadOnly Property CannotAddToOptions As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotAddToOptions {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace